Terraform Plan:

```
module.cloudflare_dns.data.cloudflare_zone.zone: Reading...
module.cloudflare_dns.data.cloudflare_zone.zone: Read complete after 0s [id=7d3f63ac039666ab600b5796c54e7ba6]
oci_identity_compartment.k8s: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa4bbfmz332ypqxr6icuitp54jj7czdp4qliuo575ytuqakppgtmra]
module.virtual_machine.data.oci_identity_availability_domains.ads: Reading...
module.virtual_network.oci_core_vcn.vcn["vcn1"]: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaic6ifviawy53vzv7ylnbovxzlk6gdl3wj62qt7pazvsl3pinvxiq]
module.virtual_machine.data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-2220574233]
module.virtual_network.oci_core_internet_gateway.igw["vcn1"]: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaafkt7nrvasfyvu4a7daqfqskkfh4vmbqpye7qr35abqnhrumie32a]
module.virtual_network.oci_core_network_security_group.nsg["vcn1"]: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaaphiusldsxpmy7odws7mwaitxvfeu52ntgbb2vkwe7fzhvyckb45q]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"]: Refreshing state... [id=96F721]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule3"]: Refreshing state... [id=868C1D]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule2"]: Refreshing state... [id=73C8D4]
module.virtual_network.oci_core_route_table.rt["vcn1"]: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaa5jyv5xby72ed73eqsxt3t7o6z7symzmk3we5rhpongsnakijdzba]
module.virtual_network.oci_core_subnet.subnet["subnet1"]: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaatfy3s5otqei4lcl7czf6jk7bliptcfwx4e35otvnd5muldjqutea]
module.virtual_machine.oci_core_volume.volume["worker1"]: Refreshing state... [id=ocid1.volume.oc1.eu-frankfurt-1.abtheljtwg7cmno4sc2puykujokfdwsk4odenr6sxgu5uktoeec73dae6zna]
module.virtual_machine.oci_core_instance.vm["worker1"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicyrvcdxqz6zmx6ahdsk44e4q23h6zabdlvo2csswwy57a]
module.virtual_machine.oci_core_volume_attachment.volume_attachment["worker1"]: Refreshing state... [id=ocid1.volumeattachment.oc1.eu-frankfurt-1.antheljtic6ifvicl3uex6qjmrdvm4vqkyb3xfmceru6xzaids6owd2i2a7a]
module.cloudflare_dns.cloudflare_record.a_record["worker1"]: Refreshing state... [id=85b2b2202a344df108f0d1f90ab7a0c6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudflare_dns.cloudflare_record.a_record["vojta"] will be created
  + resource "cloudflare_record" "a_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vojta"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "7d3f63ac039666ab600b5796c54e7ba6"
    }

  # module.virtual_machine.oci_core_instance.vm["vojta"] will be created
  + resource "oci_core_instance" "vm" {
      + availability_domain                 = "YnJT:EU-FRANKFURT-1-AD-3"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "vojta"
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAgEApUVk+sbM7bAiCzuMzE4N3ShweHsoHuhejsUiB4xRqtGsQtkl3VIfDHJ1rFI4F/gLraLJRmnH+BMBHXjrO/+PiYTKsDeIuOYzAAUGVVPd/SSiB3fXAmpPtlHyoFQ4IlpzkhaKro2FBA01d3l1rMwhy5osRj7S3aQaUJ1phMbjWqBswbeM2sHns6cPo5l5zX9HbI0NPSYOnSBiXypQMPq+7T5K8oNW8AC9DcuAy2ps9WwDSJi9tUPOZXdSTalWGdGPzBRrDohK8JwGWcVnMHl7bjNkhMr5dZpZNQOj859qM+K4KzY1m29/4Vh9yUyWKn8Odx1+clBEEesXobGKgriEhEXSUYWpXYlG4JxFNNvonlsIPQ4MxDBSZs3e6s/6MHOzYM+JmlQuBl6OR83AzxLsHD+f0UDmLEY7oLy4VvX8c8kt2a5ql5s9mTQ5ydJCdqvJOMGaz+vHd+V5ueuMm5Ibcq7HzidQb6XROG/hVOR7e0mi7JCqq1tRTB3tcTjOVNZ93MjrBV1f94AnNQP+67lBI3wmItEntUyMD2I26ffcMcmKPLe/aAHD0iJcY5RG/v5zyHKV9tQt59oBJUEpNgPS1qFY98ie5mgwW1EGCxDcd+5RaBWYTo1tGjLONBdchbWGHXEcM58toep3I0e8NlDjE9SewblLR/SEHx4LG6uSxU8= oracle-cloud_2021-09-0"
        }
      + preserve_boot_volume                = false
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + create_vnic_details {
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = (known after apply)
          + nsg_ids                = [
              + "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaaphiusldsxpmy7odws7mwaitxvfeu52ntgbb2vkwe7fzhvyckb45q",
            ]
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = "ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaatfy3s5otqei4lcl7czf6jk7bliptcfwx4e35otvnd5muldjqutea"
          + vlan_id                = (known after apply)
        }

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 1
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 1
          + processor_description         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.eu-frankfurt-1.aaaaaaaazjh7dx5267q4cpzeg7fgxhyluqq42usze6ahijkrs6bnwg2d2mdq"
          + source_type             = "image"
        }
    }

  # module.virtual_machine.oci_core_volume.volume["vojta"] will be created
  + resource "oci_core_volume" "volume" {
      + auto_tuned_vpus_per_gb = (known after apply)
      + availability_domain    = "YnJT:EU-FRANKFURT-1-AD-3"
      + backup_policy_id       = (known after apply)
      + compartment_id         = "ocid1.tenancy.oc1..aaaaaaaao7q2d72t4s3fe2wjrthjlux4eeazjbh4wkiilmdg4t7fd5jdn5ya"
      + defined_tags           = (known after apply)
      + display_name           = "vojta_50GB"
      + freeform_tags          = (known after apply)
      + id                     = (known after apply)
      + is_auto_tune_enabled   = (known after apply)
      + is_hydrated            = (known after apply)
      + kms_key_id             = (known after apply)
      + size_in_gbs            = "50"
      + size_in_mbs            = (known after apply)
      + state                  = (known after apply)
      + system_tags            = (known after apply)
      + time_created           = (known after apply)
      + volume_backup_id       = (known after apply)
      + volume_group_id        = (known after apply)
      + vpus_per_gb            = (known after apply)
    }

  # module.virtual_machine.oci_core_volume_attachment.volume_attachment["vojta"] will be created
  + resource "oci_core_volume_attachment" "volume_attachment" {
      + attachment_type                     = "paravirtualized"
      + availability_domain                 = (known after apply)
      + chap_secret                         = (known after apply)
      + chap_username                       = (known after apply)
      + compartment_id                      = (known after apply)
      + device                              = (known after apply)
      + display_name                        = (known after apply)
      + encryption_in_transit_type          = (known after apply)
      + id                                  = (known after apply)
      + instance_id                         = (known after apply)
      + ipv4                                = (known after apply)
      + iqn                                 = (known after apply)
      + is_agent_auto_iscsi_login_enabled   = (known after apply)
      + is_multipath                        = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + is_read_only                        = (known after apply)
      + is_shareable                        = (known after apply)
      + iscsi_login_state                   = (known after apply)
      + multipath_devices                   = (known after apply)
      + port                                = (known after apply)
      + state                               = (known after apply)
      + time_created                        = (known after apply)
      + use_chap                            = (known after apply)
      + volume_id                           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ vm_public_ip = {
      + vojta   = (known after apply)
        # (1 unchanged attribute hidden)
    }
```

Plan saved to GH artifacts.